### 1.Import Depencies

In [1]:
import pandas as pd 
import numpy as np

### 2 Loading the Dataset

In [2]:
df=pd.read_csv("../data/processed/ChurnModelling_cleaned.csv")
df.head()

,Firstname,Lastname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,Grace,Williams,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,David,Jones,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,Hank,Williams,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,Eva,Taylor,699,France,Female,NaN,1,0.00,2,0,0,93826.63,0
4,Grace,Miller,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

### 3.Basic EDA

In [3]:
df.describe()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.000000,9400.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,650.528800,38.912128,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,96.653299,10.512778,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

In [4]:
df.isnull().sum()

Firstname            7
Lastname             6
CreditScore          0
Geography            0
Gender             108
Age                600
Tenure               0
Balance              0
NumOfProducts        0
HasCrCard            0
IsActiveMember       0
EstimatedSalary      0
Exited               0
dtype: int64

In [7]:
df.dropna(subset=['Firstname','Lastname'], axis=0, inplace=True)

In [8]:
df.isnull().sum()

Firstname            0
Lastname             0
CreditScore          0
Geography            0
Gender             108
Age                600
Tenure               0
Balance              0
NumOfProducts        0
HasCrCard            0
IsActiveMember       0
EstimatedSalary      0
Exited               0
dtype: int64

In [9]:
df.head()

,Firstname,Lastname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,Grace,Williams,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,David,Jones,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,Hank,Williams,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,Eva,Taylor,699,France,Female,NaN,1,0.00,2,0,0,93826.63,0
4,Grace,Miller,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

In [11]:
numerical_cols = ['CreditScore','Age','Tenure','Balance','EstimatedSalary']
categorical_cols =['Geography','Gender','HasCrCard','IsActiveMember','NumOfProducts']